🤖 <b>Wimme — бот для ведения бюджета</b>

Бот умеет:

💰 создавать доходы и расходы
🔎 искать транзакции
🗑 удалять транзакции
📊 показывать отчёты

━━━━━━━━━━━━━━

💰 <b>Добавить транзакцию</b>

/add_income — доход
/add_expense — расход

Далее бот попросит:
1️⃣ выбрать категорию
2️⃣ ввести сумму
3️⃣ указать дату (необязательно)
4️⃣ добавить комментарий (необязательно)

<b>Формат суммы</b>
Можно вводить:
1
1.21
2,37
5,1
7.40

<b>Формат даты</b>

ДД.ММ.ГГГГ

Примеры:
1.1.2025
01.01.2026
━━━━━━━━━━━━━━

🔎 <b>Найти транзакцию</b>

/search_transactions

1️⃣ выберите тип
2️⃣ выберите категорию
Бот покажет 10 последних транзакций

У каждой транзакции есть номер — он нужен для удаления

━━━━━━━━━━━━━━

🗑 <b>Удалить транзакцию</b>

/delete_transaction

1️⃣ введите номер транзакции
2️⃣ проверьте данные
3️⃣ подтвердите удаление


━━━━━━━━━━━━━━

⚠️ <b>Если бот завис</b>

Используйте команду /balance
Она сбросит текущий шаг

━━━━━━━━━━━━━━

📋 Список команд:
/commands

ℹ️ Обратная связь:
/info
