ℹ️ <b>О боте</b>

Привет! Я - Саша, разработчик этого бота.
Если интересно как я его разрабатываю и вообще про ведение бюджета, подписывайтесь на канал:
✉️ <b>t.me/code_and_wallet</b>

В директ канала так же можно написать, если вы <b>нашли баг или есть предложения</b>.

🔐 <b>Приватность</b>
Я серьезно отношусь к защите данных и храню только минимум информации.

<b>Что хранится:</b>
• Telegram ID и никнейм
• обезличенные данные о транзакциях (сумма, категория, дата)

<b>Что НЕ хранится:</b>
❌ ФИО
❌ номера телефонов
❌ паспортные данные
❌ данные банковских карт или счетов
